; domain
(define (domain Depot)
(:requirements :strips :typing)
(:types place locatable - object
	depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place)
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface))

(:action Drive
  :parameters (?x - truck ?y - place ?z - place)
  :precondition (and (at ?x ?y))
  :effect (and (not (at ?x ?y)) (at ?x ?z)))

(:action Lift
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
  :effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) (clear ?z) (not (on ?y ?z))))

(:action Drop
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
  :effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)(on ?y ?z)))

(:action Load
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y))
  :effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)))

(:action Unload
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
  :effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)))
)

; problem
(define (problem depotprob27) (:domain Depot)
(:objects
	depot0 depot1 depot2 - Depot
	distributor0 distributor1 distributor2 - Distributor
	truck0 truck1 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 pallet9 pallet10 pallet11 pallet12 pallet13 pallet14 - Pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 crate10 crate11 crate12 crate13 crate14 crate15 crate16 crate17 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 - Hoist)
(:init
	(at pallet0 depot0)
	(clear pallet0)
	(at pallet1 depot1)
	(clear crate15)
	(at pallet2 depot2)
	(clear pallet2)
	(at pallet3 distributor0)
	(clear crate13)
	(at pallet4 distributor1)
	(clear crate12)
	(at pallet5 distributor2)
	(clear crate8)
	(at pallet6 distributor2)
	(clear crate11)
	(at pallet7 distributor0)
	(clear crate2)
	(at pallet8 distributor1)
	(clear crate16)
	(at pallet9 depot2)
	(clear crate1)
	(at pallet10 distributor1)
	(clear pallet10)
	(at pallet11 depot2)
	(clear crate17)
	(at pallet12 distributor0)
	(clear pallet12)
	(at pallet13 depot2)
	(clear pallet13)
	(at pallet14 distributor2)
	(clear crate4)
	(at truck0 distributor0)
	(at truck1 depot2)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at crate0 depot2)
	(on crate0 pallet11)
	(at crate1 depot2)
	(on crate1 pallet9)
	(at crate2 distributor0)
	(on crate2 pallet7)
	(at crate3 distributor2)
	(on crate3 pallet5)
	(at crate4 distributor2)
	(on crate4 pallet14)
	(at crate5 distributor2)
	(on crate5 crate3)
	(at crate6 depot2)
	(on crate6 crate0)
	(at crate7 depot2)
	(on crate7 crate6)
	(at crate8 distributor2)
	(on crate8 crate5)
	(at crate9 depot1)
	(on crate9 pallet1)
	(at crate10 depot1)
	(on crate10 crate9)
	(at crate11 distributor2)
	(on crate11 pallet6)
	(at crate12 distributor1)
	(on crate12 pallet4)
	(at crate13 distributor0)
	(on crate13 pallet3)
	(at crate14 distributor1)
	(on crate14 pallet8)
	(at crate15 depot1)
	(on crate15 crate10)
	(at crate16 distributor1)
	(on crate16 crate14)
	(at crate17 depot2)
	(on crate17 crate7)
)

(:goal (and
		(on crate0 pallet1)
		(on crate1 crate4)
		(on crate2 pallet13)
		(on crate4 crate15)
		(on crate5 crate10)
		(on crate6 crate8)
		(on crate7 pallet3)
		(on crate8 pallet5)
		(on crate9 crate11)
		(on crate10 crate12)
		(on crate11 pallet8)
		(on crate12 pallet7)
		(on crate13 pallet12)
		(on crate14 crate16)
		(on crate15 pallet9)
		(on crate16 pallet11)
		(on crate17 pallet4)
	)
))

; plan
1. (drive truck0 distributor0 depot1)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot1)
   goals met: 0 of 17
2. (lift hoist3 crate13 pallet3 distributor0)
   deleted: (at crate13 distributor0) (clear crate13) (available hoist3) (on crate13 pallet3)
   added: (lifting hoist3 crate13) (clear pallet3)
   goals met: 0 of 17
3. (drop hoist3 crate13 pallet12 distributor0)
   deleted: (lifting hoist3 crate13) (clear pallet12)
   added: (available hoist3) (at crate13 distributor0) (clear crate13) (on crate13 pallet12)
   goals met: 1 of 17
4. (lift hoist1 crate15 crate10 depot1)
   deleted: (at crate15 depot1) (clear crate15) (available hoist1) (on crate15 crate10)
   added: (lifting hoist1 crate15) (clear crate10)
   goals met: 1 of 17
5. (load hoist1 crate15 truck0 depot1)
   deleted: (lifting hoist1 crate15)
   added: (in crate15 truck0) (available hoist1)
   goals met: 1 of 17
6. (lift hoist3 crate2 pallet7 distributor0)
   deleted: (at crate2 distributor0) (clear crate2) (available hoist3) (on crate2 pallet7)
   added: (lifting hoist3 crate2) (clear pallet7)
   goals met: 1 of 17
7. (drive truck0 depot1 depot2)
   deleted: (at truck0 depot1)
   added: (at truck0 depot2)
   goals met: 1 of 17
8. (drive truck1 depot2 distributor0)
   deleted: (at truck1 depot2)
   added: (at truck1 distributor0)
   goals met: 1 of 17
9. (load hoist3 crate2 truck1 distributor0)
   deleted: (lifting hoist3 crate2)
   added: (in crate2 truck1) (available hoist3)
   goals met: 1 of 17
10. (drive truck1 distributor0 depot2)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot2)
   goals met: 1 of 17
11. (lift hoist1 crate10 crate9 depot1)
   deleted: (at crate10 depot1) (clear crate10) (available hoist1) (on crate10 crate9)
   added: (lifting hoist1 crate10) (clear crate9)
   goals met: 1 of 17
12. (drive truck0 depot2 depot1)
   deleted: (at truck0 depot2)
   added: (at truck0 depot1)
   goals met: 1 of 17
13. (load hoist1 crate10 truck0 depot1)
   deleted: (lifting hoist1 crate10)
   added: (in crate10 truck0) (available hoist1)
   goals met: 1 of 17
14. (drive truck0 depot1 distributor1)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor1)
   goals met: 1 of 17
15. (lift hoist1 crate9 pallet1 depot1)
   deleted: (at crate9 depot1) (clear crate9) (available hoist1) (on crate9 pallet1)
   added: (lifting hoist1 crate9) (clear pallet1)
   goals met: 1 of 17
16. (drive truck0 distributor1 depot1)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot1)
   goals met: 1 of 17
17. (load hoist1 crate9 truck0 depot1)
   deleted: (lifting hoist1 crate9)
   added: (in crate9 truck0) (available hoist1)
   goals met: 1 of 17
18. (drive truck0 depot1 depot2)
   deleted: (at truck0 depot1)
   added: (at truck0 depot2)
   goals met: 1 of 17
19. (drive truck0 depot2 distributor1)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor1)
   goals met: 1 of 17
20. (drive truck0 distributor1 distributor2)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor2)
   goals met: 1 of 17
21. (lift hoist4 crate16 crate14 distributor1)
   deleted: (at crate16 distributor1) (clear crate16) (available hoist4) (on crate16 crate14)
   added: (lifting hoist4 crate16) (clear crate14)
   goals met: 1 of 17
22. (drop hoist4 crate16 pallet10 distributor1)
   deleted: (lifting hoist4 crate16) (clear pallet10)
   added: (available hoist4) (at crate16 distributor1) (clear crate16) (on crate16 pallet10)
   goals met: 1 of 17
23. (lift hoist4 crate14 pallet8 distributor1)
   deleted: (at crate14 distributor1) (clear crate14) (available hoist4) (on crate14 pallet8)
   added: (lifting hoist4 crate14) (clear pallet8)
   goals met: 1 of 17
24. (drop hoist4 crate14 crate16 distributor1)
   deleted: (lifting hoist4 crate14) (clear crate16)
   added: (available hoist4) (at crate14 distributor1) (clear crate14) (on crate14 crate16)
   goals met: 2 of 17
25. (drive truck0 distributor2 distributor1)
   deleted: (at truck0 distributor2)
   added: (at truck0 distributor1)
   goals met: 2 of 17
26. (unload hoist4 crate10 truck0 distributor1)
   deleted: (in crate10 truck0) (available hoist4)
   added: (lifting hoist4 crate10)
   goals met: 2 of 17
27. (drive truck0 distributor1 distributor2)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor2)
   goals met: 2 of 17
28. (drop hoist4 crate10 crate12 distributor1)
   deleted: (lifting hoist4 crate10) (clear crate12)
   added: (available hoist4) (at crate10 distributor1) (clear crate10) (on crate10 crate12)
   goals met: 3 of 17
29. (lift hoist2 crate17 crate7 depot2)
   deleted: (at crate17 depot2) (clear crate17) (available hoist2) (on crate17 crate7)
   added: (lifting hoist2 crate17) (clear crate7)
   goals met: 3 of 17
30. (load hoist2 crate17 truck1 depot2)
   deleted: (lifting hoist2 crate17)
   added: (in crate17 truck1) (available hoist2)
   goals met: 3 of 17
31. (lift hoist2 crate7 crate6 depot2)
   deleted: (at crate7 depot2) (clear crate7) (available hoist2) (on crate7 crate6)
   added: (lifting hoist2 crate7) (clear crate6)
   goals met: 3 of 17
32. (load hoist2 crate7 truck1 depot2)
   deleted: (lifting hoist2 crate7)
   added: (in crate7 truck1) (available hoist2)
   goals met: 3 of 17
33. (drive truck1 depot2 distributor0)
   deleted: (at truck1 depot2)
   added: (at truck1 distributor0)
   goals met: 3 of 17
34. (unload hoist3 crate7 truck1 distributor0)
   deleted: (in crate7 truck1) (available hoist3)
   added: (lifting hoist3 crate7)
   goals met: 3 of 17
35. (drive truck1 distributor0 depot2)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot2)
   goals met: 3 of 17
36. (drop hoist3 crate7 pallet3 distributor0)
   deleted: (lifting hoist3 crate7) (clear pallet3)
   added: (available hoist3) (at crate7 distributor0) (clear crate7) (on crate7 pallet3)
   goals met: 4 of 17
37. (lift hoist2 crate6 crate0 depot2)
   deleted: (at crate6 depot2) (clear crate6) (available hoist2) (on crate6 crate0)
   added: (lifting hoist2 crate6) (clear crate0)
   goals met: 4 of 17
38. (load hoist2 crate6 truck1 depot2)
   deleted: (lifting hoist2 crate6)
   added: (in crate6 truck1) (available hoist2)
   goals met: 4 of 17
39. (lift hoist2 crate0 pallet11 depot2)
   deleted: (at crate0 depot2) (clear crate0) (available hoist2) (on crate0 pallet11)
   added: (lifting hoist2 crate0) (clear pallet11)
   goals met: 4 of 17
40. (load hoist2 crate0 truck1 depot2)
   deleted: (lifting hoist2 crate0)
   added: (in crate0 truck1) (available hoist2)
   goals met: 4 of 17
41. (drive truck1 depot2 depot1)
   deleted: (at truck1 depot2)
   added: (at truck1 depot1)
   goals met: 4 of 17
42. (unload hoist1 crate0 truck1 depot1)
   deleted: (in crate0 truck1) (available hoist1)
   added: (lifting hoist1 crate0)
   goals met: 4 of 17
43. (drive truck1 depot1 depot2)
   deleted: (at truck1 depot1)
   added: (at truck1 depot2)
   goals met: 4 of 17
44. (drive truck1 depot2 distributor1)
   deleted: (at truck1 depot2)
   added: (at truck1 distributor1)
   goals met: 4 of 17
45. (drop hoist1 crate0 pallet1 depot1)
   deleted: (lifting hoist1 crate0) (clear pallet1)
   added: (available hoist1) (at crate0 depot1) (clear crate0) (on crate0 pallet1)
   goals met: 5 of 17
46. (drive truck1 distributor1 depot2)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot2)
   goals met: 5 of 17
47. (lift hoist2 crate1 pallet9 depot2)
   deleted: (at crate1 depot2) (clear crate1) (available hoist2) (on crate1 pallet9)
   added: (lifting hoist2 crate1) (clear pallet9)
   goals met: 5 of 17
48. (load hoist2 crate1 truck1 depot2)
   deleted: (lifting hoist2 crate1)
   added: (in crate1 truck1) (available hoist2)
   goals met: 5 of 17
49. (unload hoist2 crate2 truck1 depot2)
   deleted: (in crate2 truck1) (available hoist2)
   added: (lifting hoist2 crate2)
   goals met: 5 of 17
50. (drive truck1 depot2 distributor1)
   deleted: (at truck1 depot2)
   added: (at truck1 distributor1)
   goals met: 5 of 17
51. (drop hoist2 crate2 pallet13 depot2)
   deleted: (lifting hoist2 crate2) (clear pallet13)
   added: (available hoist2) (at crate2 depot2) (clear crate2) (on crate2 pallet13)
   goals met: 6 of 17
52. (drive truck1 distributor1 distributor2)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor2)
   goals met: 6 of 17
53. (drive truck0 distributor2 depot2)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot2)
   goals met: 6 of 17
54. (unload hoist2 crate15 truck0 depot2)
   deleted: (in crate15 truck0) (available hoist2)
   added: (lifting hoist2 crate15)
   goals met: 6 of 17
55. (drop hoist2 crate15 pallet9 depot2)
   deleted: (lifting hoist2 crate15) (clear pallet9)
   added: (available hoist2) (at crate15 depot2) (clear crate15) (on crate15 pallet9)
   goals met: 7 of 17
56. (drive truck0 depot2 distributor2)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor2)
   goals met: 7 of 17
57. (lift hoist5 crate8 crate5 distributor2)
   deleted: (at crate8 distributor2) (clear crate8) (available hoist5) (on crate8 crate5)
   added: (lifting hoist5 crate8) (clear crate5)
   goals met: 7 of 17
58. (load hoist5 crate8 truck1 distributor2)
   deleted: (lifting hoist5 crate8)
   added: (in crate8 truck1) (available hoist5)
   goals met: 7 of 17
59. (drive truck1 distributor2 distributor1)
   deleted: (at truck1 distributor2)
   added: (at truck1 distributor1)
   goals met: 7 of 17
60. (lift hoist5 crate5 crate3 distributor2)
   deleted: (at crate5 distributor2) (clear crate5) (available hoist5) (on crate5 crate3)
   added: (lifting hoist5 crate5) (clear crate3)
   goals met: 7 of 17
61. (load hoist5 crate5 truck0 distributor2)
   deleted: (lifting hoist5 crate5)
   added: (in crate5 truck0) (available hoist5)
   goals met: 7 of 17
62. (unload hoist5 crate9 truck0 distributor2)
   deleted: (in crate9 truck0) (available hoist5)
   added: (lifting hoist5 crate9)
   goals met: 7 of 17
63. (drop hoist5 crate9 crate11 distributor2)
   deleted: (lifting hoist5 crate9) (clear crate11)
   added: (available hoist5) (at crate9 distributor2) (clear crate9) (on crate9 crate11)
   goals met: 8 of 17
64. (drive truck1 distributor1 distributor2)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor2)
   goals met: 8 of 17
65. (unload hoist5 crate8 truck1 distributor2)
   deleted: (in crate8 truck1) (available hoist5)
   added: (lifting hoist5 crate8)
   goals met: 8 of 17
66. (drive truck1 distributor2 distributor1)
   deleted: (at truck1 distributor2)
   added: (at truck1 distributor1)
   goals met: 8 of 17
67. (drop hoist5 crate8 crate9 distributor2)
   deleted: (lifting hoist5 crate8) (clear crate9)
   added: (available hoist5) (at crate8 distributor2) (clear crate8) (on crate8 crate9)
   goals met: 8 of 17
68. (drive truck1 distributor1 distributor2)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor2)
   goals met: 8 of 17
69. (drive truck0 distributor2 distributor1)
   deleted: (at truck0 distributor2)
   added: (at truck0 distributor1)
   goals met: 8 of 17
70. (lift hoist5 crate4 pallet14 distributor2)
   deleted: (at crate4 distributor2) (clear crate4) (available hoist5) (on crate4 pallet14)
   added: (lifting hoist5 crate4) (clear pallet14)
   goals met: 8 of 17
71. (load hoist5 crate4 truck1 distributor2)
   deleted: (lifting hoist5 crate4)
   added: (in crate4 truck1) (available hoist5)
   goals met: 8 of 17
72. (drive truck1 distributor2 depot2)
   deleted: (at truck1 distributor2)
   added: (at truck1 depot2)
   goals met: 8 of 17
73. (unload hoist2 crate4 truck1 depot2)
   deleted: (in crate4 truck1) (available hoist2)
   added: (lifting hoist2 crate4)
   goals met: 8 of 17
74. (drive truck1 depot2 distributor2)
   deleted: (at truck1 depot2)
   added: (at truck1 distributor2)
   goals met: 8 of 17
75. (drop hoist2 crate4 crate15 depot2)
   deleted: (lifting hoist2 crate4) (clear crate15)
   added: (available hoist2) (at crate4 depot2) (clear crate4) (on crate4 crate15)
   goals met: 9 of 17
76. (drive truck1 distributor2 depot2)
   deleted: (at truck1 distributor2)
   added: (at truck1 depot2)
   goals met: 9 of 17
77. (unload hoist2 crate1 truck1 depot2)
   deleted: (in crate1 truck1) (available hoist2)
   added: (lifting hoist2 crate1)
   goals met: 9 of 17
78. (drive truck1 depot2 distributor1)
   deleted: (at truck1 depot2)
   added: (at truck1 distributor1)
   goals met: 9 of 17
79. (drive truck1 distributor1 distributor2)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor2)
   goals met: 9 of 17
80. (drop hoist2 crate1 crate4 depot2)
   deleted: (lifting hoist2 crate1) (clear crate4)
   added: (available hoist2) (at crate1 depot2) (clear crate1) (on crate1 crate4)
   goals met: 10 of 17
81. (lift hoist5 crate8 crate9 distributor2)
   deleted: (at crate8 distributor2) (clear crate8) (available hoist5) (on crate8 crate9)
   added: (lifting hoist5 crate8) (clear crate9)
   goals met: 10 of 17
82. (load hoist5 crate8 truck1 distributor2)
   deleted: (lifting hoist5 crate8)
   added: (in crate8 truck1) (available hoist5)
   goals met: 10 of 17
83. (drive truck1 distributor2 distributor1)
   deleted: (at truck1 distributor2)
   added: (at truck1 distributor1)
   goals met: 10 of 17
84. (lift hoist5 crate9 crate11 distributor2)
   deleted: (at crate9 distributor2) (clear crate9) (available hoist5) (on crate9 crate11)
   added: (lifting hoist5 crate9) (clear crate11)
   goals met: 9 of 17
85. (drop hoist5 crate9 pallet14 distributor2)
   deleted: (lifting hoist5 crate9) (clear pallet14)
   added: (available hoist5) (at crate9 distributor2) (clear crate9) (on crate9 pallet14)
   goals met: 9 of 17
86. (drive truck1 distributor1 distributor2)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor2)
   goals met: 9 of 17
87. (unload hoist5 crate8 truck1 distributor2)
   deleted: (in crate8 truck1) (available hoist5)
   added: (lifting hoist5 crate8)
   goals met: 9 of 17
88. (drive truck1 distributor2 distributor1)
   deleted: (at truck1 distributor2)
   added: (at truck1 distributor1)
   goals met: 9 of 17
89. (drop hoist5 crate8 crate9 distributor2)
   deleted: (lifting hoist5 crate8) (clear crate9)
   added: (available hoist5) (at crate8 distributor2) (clear crate8) (on crate8 crate9)
   goals met: 9 of 17
90. (drive truck1 distributor1 distributor2)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor2)
   goals met: 9 of 17
91. (lift hoist5 crate11 pallet6 distributor2)
   deleted: (at crate11 distributor2) (clear crate11) (available hoist5) (on crate11 pallet6)
   added: (lifting hoist5 crate11) (clear pallet6)
   goals met: 9 of 17
92. (load hoist5 crate11 truck1 distributor2)
   deleted: (lifting hoist5 crate11)
   added: (in crate11 truck1) (available hoist5)
   goals met: 9 of 17
93. (drive truck1 distributor2 distributor1)
   deleted: (at truck1 distributor2)
   added: (at truck1 distributor1)
   goals met: 9 of 17
94. (lift hoist5 crate8 crate9 distributor2)
   deleted: (at crate8 distributor2) (clear crate8) (available hoist5) (on crate8 crate9)
   added: (lifting hoist5 crate8) (clear crate9)
   goals met: 9 of 17
95. (drop hoist5 crate8 pallet6 distributor2)
   deleted: (lifting hoist5 crate8) (clear pallet6)
   added: (available hoist5) (at crate8 distributor2) (clear crate8) (on crate8 pallet6)
   goals met: 9 of 17
96. (drive truck1 distributor1 distributor2)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor2)
   goals met: 9 of 17
97. (unload hoist5 crate6 truck1 distributor2)
   deleted: (in crate6 truck1) (available hoist5)
   added: (lifting hoist5 crate6)
   goals met: 9 of 17
98. (drive truck1 distributor2 distributor1)
   deleted: (at truck1 distributor2)
   added: (at truck1 distributor1)
   goals met: 9 of 17
99. (drop hoist5 crate6 crate8 distributor2)
   deleted: (lifting hoist5 crate6) (clear crate8)
   added: (available hoist5) (at crate6 distributor2) (clear crate6) (on crate6 crate8)
   goals met: 10 of 17
100. (lift hoist5 crate9 pallet14 distributor2)
   deleted: (at crate9 distributor2) (clear crate9) (available hoist5) (on crate9 pallet14)
   added: (lifting hoist5 crate9) (clear pallet14)
   goals met: 10 of 17
101. (drive truck1 distributor1 distributor2)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor2)
   goals met: 10 of 17
102. (load hoist5 crate9 truck1 distributor2)
   deleted: (lifting hoist5 crate9)
   added: (in crate9 truck1) (available hoist5)
   goals met: 10 of 17
103. (drive truck1 distributor2 distributor1)
   deleted: (at truck1 distributor2)
   added: (at truck1 distributor1)
   goals met: 10 of 17
104. (unload hoist4 crate11 truck1 distributor1)
   deleted: (in crate11 truck1) (available hoist4)
   added: (lifting hoist4 crate11)
   goals met: 10 of 17
105. (drop hoist4 crate11 pallet8 distributor1)
   deleted: (lifting hoist4 crate11) (clear pallet8)
   added: (available hoist4) (at crate11 distributor1) (clear crate11) (on crate11 pallet8)
   goals met: 11 of 17
106. (unload hoist4 crate9 truck1 distributor1)
   deleted: (in crate9 truck1) (available hoist4)
   added: (lifting hoist4 crate9)
   goals met: 11 of 17
107. (drop hoist4 crate9 crate11 distributor1)
   deleted: (lifting hoist4 crate9) (clear crate11)
   added: (available hoist4) (at crate9 distributor1) (clear crate9) (on crate9 crate11)
   goals met: 12 of 17
108. (lift hoist4 crate14 crate16 distributor1)
   deleted: (at crate14 distributor1) (clear crate14) (available hoist4) (on crate14 crate16)
   added: (lifting hoist4 crate14) (clear crate16)
   goals met: 11 of 17
109. (load hoist4 crate14 truck0 distributor1)
   deleted: (lifting hoist4 crate14)
   added: (in crate14 truck0) (available hoist4)
   goals met: 11 of 17
110. (lift hoist4 crate16 pallet10 distributor1)
   deleted: (at crate16 distributor1) (clear crate16) (available hoist4) (on crate16 pallet10)
   added: (lifting hoist4 crate16) (clear pallet10)
   goals met: 11 of 17
111. (load hoist4 crate16 truck1 distributor1)
   deleted: (lifting hoist4 crate16)
   added: (in crate16 truck1) (available hoist4)
   goals met: 11 of 17
112. (drive truck1 distributor1 depot2)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot2)
   goals met: 11 of 17
113. (unload hoist2 crate16 truck1 depot2)
   deleted: (in crate16 truck1) (available hoist2)
   added: (lifting hoist2 crate16)
   goals met: 11 of 17
114. (drive truck1 depot2 distributor1)
   deleted: (at truck1 depot2)
   added: (at truck1 distributor1)
   goals met: 11 of 17
115. (drop hoist2 crate16 pallet11 depot2)
   deleted: (lifting hoist2 crate16) (clear pallet11)
   added: (available hoist2) (at crate16 depot2) (clear crate16) (on crate16 pallet11)
   goals met: 12 of 17
116. (drive truck0 distributor1 depot2)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot2)
   goals met: 12 of 17
117. (unload hoist2 crate14 truck0 depot2)
   deleted: (in crate14 truck0) (available hoist2)
   added: (lifting hoist2 crate14)
   goals met: 12 of 17
118. (drop hoist2 crate14 crate16 depot2)
   deleted: (lifting hoist2 crate14) (clear crate16)
   added: (available hoist2) (at crate14 depot2) (clear crate14) (on crate14 crate16)
   goals met: 13 of 17
119. (lift hoist4 crate10 crate12 distributor1)
   deleted: (at crate10 distributor1) (clear crate10) (available hoist4) (on crate10 crate12)
   added: (lifting hoist4 crate10) (clear crate12)
   goals met: 12 of 17
120. (load hoist4 crate10 truck1 distributor1)
   deleted: (lifting hoist4 crate10)
   added: (in crate10 truck1) (available hoist4)
   goals met: 12 of 17
121. (lift hoist4 crate12 pallet4 distributor1)
   deleted: (at crate12 distributor1) (clear crate12) (available hoist4) (on crate12 pallet4)
   added: (lifting hoist4 crate12) (clear pallet4)
   goals met: 12 of 17
122. (load hoist4 crate12 truck1 distributor1)
   deleted: (lifting hoist4 crate12)
   added: (in crate12 truck1) (available hoist4)
   goals met: 12 of 17
123. (drive truck1 distributor1 distributor0)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor0)
   goals met: 12 of 17
124. (unload hoist3 crate12 truck1 distributor0)
   deleted: (in crate12 truck1) (available hoist3)
   added: (lifting hoist3 crate12)
   goals met: 12 of 17
125. (drive truck1 distributor0 distributor1)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor1)
   goals met: 12 of 17
126. (drive truck0 depot2 distributor1)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor1)
   goals met: 12 of 17
127. (drop hoist3 crate12 pallet7 distributor0)
   deleted: (lifting hoist3 crate12) (clear pallet7)
   added: (available hoist3) (at crate12 distributor0) (clear crate12) (on crate12 pallet7)
   goals met: 13 of 17
128. (drive truck1 distributor1 distributor0)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor0)
   goals met: 13 of 17
129. (unload hoist3 crate10 truck1 distributor0)
   deleted: (in crate10 truck1) (available hoist3)
   added: (lifting hoist3 crate10)
   goals met: 13 of 17
130. (drive truck1 distributor0 distributor1)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor1)
   goals met: 13 of 17
131. (unload hoist4 crate17 truck1 distributor1)
   deleted: (in crate17 truck1) (available hoist4)
   added: (lifting hoist4 crate17)
   goals met: 13 of 17
132. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   goals met: 13 of 17
133. (drop hoist4 crate17 pallet4 distributor1)
   deleted: (lifting hoist4 crate17) (clear pallet4)
   added: (available hoist4) (at crate17 distributor1) (clear crate17) (on crate17 pallet4)
   goals met: 14 of 17
134. (drop hoist3 crate10 crate12 distributor0)
   deleted: (lifting hoist3 crate10) (clear crate12)
   added: (available hoist3) (at crate10 distributor0) (clear crate10) (on crate10 crate12)
   goals met: 15 of 17
135. (unload hoist3 crate5 truck0 distributor0)
   deleted: (in crate5 truck0) (available hoist3)
   added: (lifting hoist3 crate5)
   goals met: 15 of 17
136. (drop hoist3 crate5 crate10 distributor0)
   deleted: (lifting hoist3 crate5) (clear crate10)
   added: (available hoist3) (at crate5 distributor0) (clear crate5) (on crate5 crate10)
   goals met: 16 of 17
137. (lift hoist5 crate3 pallet5 distributor2)
   deleted: (at crate3 distributor2) (clear crate3) (available hoist5) (on crate3 pallet5)
   added: (lifting hoist5 crate3) (clear pallet5)
   goals met: 16 of 17
138. (drop hoist5 crate3 pallet14 distributor2)
   deleted: (lifting hoist5 crate3) (clear pallet14)
   added: (available hoist5) (at crate3 distributor2) (clear crate3) (on crate3 pallet14)
   goals met: 16 of 17
139. (drive truck1 distributor1 distributor2)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor2)
   goals met: 16 of 17
140. (lift hoist5 crate6 crate8 distributor2)
   deleted: (at crate6 distributor2) (clear crate6) (available hoist5) (on crate6 crate8)
   added: (lifting hoist5 crate6) (clear crate8)
   goals met: 15 of 17
141. (load hoist5 crate6 truck1 distributor2)
   deleted: (lifting hoist5 crate6)
   added: (in crate6 truck1) (available hoist5)
   goals met: 15 of 17
142. (lift hoist5 crate8 pallet6 distributor2)
   deleted: (at crate8 distributor2) (clear crate8) (available hoist5) (on crate8 pallet6)
   added: (lifting hoist5 crate8) (clear pallet6)
   goals met: 15 of 17
143. (drop hoist5 crate8 pallet5 distributor2)
   deleted: (lifting hoist5 crate8) (clear pallet5)
   added: (available hoist5) (at crate8 distributor2) (clear crate8) (on crate8 pallet5)
   goals met: 16 of 17
144. (unload hoist5 crate6 truck1 distributor2)
   deleted: (in crate6 truck1) (available hoist5)
   added: (lifting hoist5 crate6)
   goals met: 16 of 17
145. (drop hoist5 crate6 crate8 distributor2)
   deleted: (lifting hoist5 crate6) (clear crate8)
   added: (available hoist5) (at crate6 distributor2) (clear crate6) (on crate6 crate8)
   goals met: 17 of 17
